app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `warga`
---
    public function index()
    {
        $wargaModel = new WargaModel();
        $iuranModel = new IuranModel();
        $transaksiModel = new TransaksiModel();

        $totalWarga = $wargaModel->countAll();

SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaksi`
WHERE `jenis` = 'masuk'
 LIMIT 1
SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaksi`
WHERE `jenis` = 'keluar'
 LIMIT 1
---
    protected function calculateSaldoKas()
    {
        $transaksiModel = new TransaksiModel();

        $totalMasuk = $transaksiModel->where('jenis', 'masuk')->selectSum('jumlah')->first()['jumlah'] ?? 0;
        $totalKeluar = $transaksiModel->where('jenis', 'keluar')->selectSum('jumlah')->first()['jumlah'] ?? 0;

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `id_warga`
FROM `iuran`
WHERE `status` = 'lunas'
AND `bulan` = 'July'
AND `tahun` = '2025'
GROUP BY `id_warga`
) CI_count_all_results
---
    protected function calculatePersentaseIuran($totalWarga)
    {
        if ($totalWarga == 0) {
            return 0;
        }

        $bulan = date('m');
        $tahun = date('Y');
        $namaBulan = date('F', mktime(0, 0, 0, $bulan, 1));

        $db = \Config\Database::connect();
        $builder = $db->table('iuran');
        $builder->select('id_warga');
        $builder->where('status', 'lunas');
        $builder->where('bulan', $namaBulan);
        $builder->where('tahun', $tahun);
        $builder->groupBy('id_warga');

        $jumlahSudahBayar = $builder->countAllResults(false);