app/Models/IuranModel.php

    public function getTotalIuran()
    {
        $result = $this->selectSum('nominal')->first();
---
SELECT SUM(`nominal`) AS `nominal`
FROM `iuran`
 LIMIT 1