app/Models/TransaksiModel.php

SELECT *
FROM `transaksi`
ORDER BY `tanggal` DESC
 LIMIT 5
SELECT *
FROM `warga`
WHERE `warga_id` = '31'
---
    public function getTransaksiSimple($limit = 5)
    {
        $builder = $this->db->table($this->table)
            ->orderBy('tanggal', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        $transaksi = $builder->get()->getResultArray();

        // Ambil nama warga secara manual
        foreach ($transaksi as &$t) {
            if ($t['id_warga'] && $t['id_warga'] > 0) {
                $warga = $this->db->table('warga')
                    ->where('warga_id', $t['id_warga'])
                    ->get()
                    ->getRowArray();

SELECT `transaksi`.*, `warga`.`nama` as `nama_warga`
FROM `transaksi`
LEFT JOIN `warga` ON `warga`.`warga_id` = `transaksi`.`id_warga` AND `transaksi`.`id_warga` > 0
WHERE DATE_FORMAT(transaksi.tanggal, '%Y-%m') = '2025-07'
ORDER BY `transaksi`.`tanggal` DESC
---
    public function getTransaksiBulanIni($bulanTahun = null)
    {
        if (!$bulanTahun) {
            $bulanTahun = date('Y-m');
        }

        $builder = $this->db->table($this->table)
            ->select('transaksi.*, warga.nama as nama_warga')
            ->join('warga', 'warga.warga_id = transaksi.id_warga AND transaksi.id_warga > 0', 'left')
            ->where("DATE_FORMAT(transaksi.tanggal, '%Y-%m')", $bulanTahun)
            ->orderBy('transaksi.tanggal', 'DESC');

        $results = $builder->get()->getResultArray();

SELECT `transaksi`.*, `warga`.`nama` as `nama_warga`
FROM `transaksi`
LEFT JOIN `warga` ON `warga`.`warga_id` = `transaksi`.`id_warga` AND `transaksi`.`id_warga` > 0
ORDER BY `transaksi`.`tanggal` DESC
---
    public function getAllTransaksi($limit = null)
    {
        $builder = $this->db->table($this->table)
            ->select('transaksi.*, warga.nama as nama_warga')
            ->join('warga', 'warga.warga_id = transaksi.id_warga AND transaksi.id_warga > 0', 'left')
            ->orderBy('transaksi.tanggal', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        $results = $builder->get()->getResultArray();